# Цели и задачи. Поток выполнения программы. Как интерпретатор показывает переменные.
"""
Задача:

    1. Запустите проект нажав на иконку дебага справа от запуска проекта "жучок"
    2. В консоли посмотрите на результат программы
    3. Используйте Step Over для перехода к следующему шагу выполнения программы
    4. Посмотрите на консоль и на ход выполнения программы
    5. Приложите скриншот (изображение), написанного кода
"""
print('Hi, PyCharm')
x = 43
y = 32
print(x * y)
print("End line")
